[{"url":"/","title":"Philosophy of Cognitive Science","breadcrumbs":[{"title":"Philosophy of Cognitive Science","url":"/"}],"content":"# Philosphy of Cognitive Science\nThis repository is for anyone interested in philosophy of Cognitive Science.\n\n\n## Stack\nThis repo uses [GitDocs](https://gitdocs.netlify.com/) framwork, which is a documentation generator from [markdown](https://www.markdownguide.org/) files."},{"url":"/david-marr/","title":"David Marr","breadcrumbs":[{"title":"Philosophy of Cognitive Science","url":"/"},{"title":"David Marr","url":"/david-marr/"}],"content":"# David Courtnay Marr\n\n## About Author\n![David Courtnay Marr](/marr.png)\n\n+ 19 January 1945 – 17 November 1980\n+ British neuroscientist and physiologist\n\n## Marr's Three Levels\nFamously known for its framework about solution to any information processing problem (IPP). It consists of **3 parts**:\n\n### 1. Computational Theory (CT)\n+ It is the fundamental formulea of the solution (if there is any).\n+ Depends on nature of the problem.\n+ It never has to be done again. There could only be one unique CT for any IPP.\n+ It is about the goal and logic of the solution.\n\n### 2. Representation & Algorithm\n+ It is about how to compute (implement) a solution.\n+ Depend on hardware\n+ Could be many for the same task unlike CT\n\n### 3. Hardware Implementation\n+ It is about how to realize the algorithm.\n\n## Type 1 and Type 2 Theories\nAccording to Marr, there are 2 types of solutions to a problem based on whether there is any computational theory:\n\n### Type 1 Theory\nIf there is a Computational Theory to the problem, it is a type 1 theory. Not all problems have that. Computational Theory provides a prediction about what exactly the problem and the solution are supposed to be doing.\nExamples: Fundamental laws of physics and mathematics...\n\n### Type 2 Theory\nWhen a problem is solved by simultaneous action of a considerable number of processes, it is a Type 2 theory.\nExamples: protein folding, deep neural networks...\n\n### Insights\n+ Marr says that Type 1 results are much more important. But Type 2 Theories are required for scientific progress.\n+ We should focus on Type 1 theories, so lets focus on fundamental problems (especially in Artificial Intelligence).\n+ Type 2 Theories are important based on their performance. If there is no performance, they should be judged harshly.\n\n## Papers\n+ [Artificial Intelligence--A Personal View](http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.111.5076&rep=rep1&type=pdf)\n\n## Quotes\n> All important fields of human endeavour start with personal commitment based on faith rather than on results. AI is just one more example. Only a sour, crabbed and unadventurous spirit will hold it against us.\n\n> David Marr"}]
